package com.chobo.puzzle.together

import java.util.ArrayList

object TogetherDatas {
    fun getTogether(): ArrayList<TogetherData> {
        val togetherList: ArrayList<TogetherData> = arrayListOf(
            TogetherData(
                "삽겹살",
                "제품명: 돼지고기 삼겹살\n" +
                        "부위: 삼겹살 (배 부분)\n" +
                        "원산지: 대한민국\n" +
                        "등급: 1등급\n" +
                        "포장 단위: 100g\n" +
                        "유통기한: 제조일로부터 7일\n" +
                        "보관 방법: 냉장 보관 (0~4℃) 또는 냉동 보관 (-18℃ 이하)\n" +
                        "특징:\n" +
                        "신선한 고기\n" +
                        "고소한 맛과 부드러운 식감\n" +
                        "구이, 볶음, 찜 등 다양한 요리에 적합\n" +
                        "안전 및 품질 인증: HACCP 인증, 무항생제 인증\n" +
                        "연락처: 010-9228-4856\n" +
                        "\n" +
                        "기타:\n" +
                        "원재료명: 돼지고기 (삼겹살)\n" +
                        "원산지: 대한민국\n" +
                        "가공 방법:\n" +
                        "도축 후 냉장 보관\n" +
                        "부위별 분리 후 진공 포장\n" +
                        "저온 상태에서 운송\n" +
                        "포장 후 냉장/냉동 보관\n" +
                        "알러지 유발 성분 정보 예시\n" +
                        "알러지 유발 성분:\n" +
                        "이 제품은 돼지고기를 포함하고 있습니다.\n" +
                        "알러지 반응이 있는 소비자는 주의하십시오.\n" +
                        "가공 과정에서 대두, 밀, 우유, 견과류와 같은 알러지 유발 성분과 교차 오염될 수 있습니다.",
                "대구광역시 라임 회장 협회산",
                15,
                1,
                "https://img.khan.co.kr/news/2019/01/10/l_2019011101001196200095012.webp",
                100,
                0
            ),
            TogetherData(
                "삽겹살",
                "제품명: 돼지고기 삼겹살\n" +
                        "부위: 삼겹살 (배 부분)\n" +
                        "원산지: 대한민국\n" +
                        "등급: 1등급\n" +
                        "포장 단위: 100g\n" +
                        "유통기한: 제조일로부터 7일\n" +
                        "보관 방법: 냉장 보관 (0~4℃) 또는 냉동 보관 (-18℃ 이하)\n" +
                        "특징:\n" +
                        "신선한 고기\n" +
                        "고소한 맛과 부드러운 식감\n" +
                        "구이, 볶음, 찜 등 다양한 요리에 적합\n" +
                        "안전 및 품질 인증: HACCP 인증, 무항생제 인증\n" +
                        "연락처: 010-9228-4856\n" +
                        "\n" +
                        "기타:\n" +
                        "원재료명: 돼지고기 (삼겹살)\n" +
                        "원산지: 대한민국\n" +
                        "가공 방법:\n" +
                        "도축 후 냉장 보관\n" +
                        "부위별 분리 후 진공 포장\n" +
                        "저온 상태에서 운송\n" +
                        "포장 후 냉장/냉동 보관\n" +
                        "알러지 유발 성분 정보 예시\n" +
                        "알러지 유발 성분:\n" +
                        "이 제품은 돼지고기를 포함하고 있습니다.\n" +
                        "알러지 반응이 있는 소비자는 주의하십시오.\n" +
                        "가공 과정에서 대두, 밀, 우유, 견과류와 같은 알러지 유발 성분과 교차 오염될 수 있습니다.",
                "대구광역시 라임 회장 협회산",
                15,
                1,
                "https://img.khan.co.kr/news/2019/01/10/l_2019011101001196200095012.webp",
                100,
                0
            ),TogetherData(
                "삽겹살",
                "제품명: 돼지고기 삼겹살\n" +
                        "부위: 삼겹살 (배 부분)\n" +
                        "원산지: 대한민국\n" +
                        "등급: 1등급\n" +
                        "포장 단위: 100g\n" +
                        "유통기한: 제조일로부터 7일\n" +
                        "보관 방법: 냉장 보관 (0~4℃) 또는 냉동 보관 (-18℃ 이하)\n" +
                        "특징:\n" +
                        "신선한 고기\n" +
                        "고소한 맛과 부드러운 식감\n" +
                        "구이, 볶음, 찜 등 다양한 요리에 적합\n" +
                        "안전 및 품질 인증: HACCP 인증, 무항생제 인증\n" +
                        "연락처: 010-9228-4856\n" +
                        "\n" +
                        "기타:\n" +
                        "원재료명: 돼지고기 (삼겹살)\n" +
                        "원산지: 대한민국\n" +
                        "가공 방법:\n" +
                        "도축 후 냉장 보관\n" +
                        "부위별 분리 후 진공 포장\n" +
                        "저온 상태에서 운송\n" +
                        "포장 후 냉장/냉동 보관\n" +
                        "알러지 유발 성분 정보 예시\n" +
                        "알러지 유발 성분:\n" +
                        "이 제품은 돼지고기를 포함하고 있습니다.\n" +
                        "알러지 반응이 있는 소비자는 주의하십시오.\n" +
                        "가공 과정에서 대두, 밀, 우유, 견과류와 같은 알러지 유발 성분과 교차 오염될 수 있습니다.",
                "대구광역시 라임 회장 협회산",
                15,
                1,
                "https://img.khan.co.kr/news/2019/01/10/l_2019011101001196200095012.webp",
                100,
                0
            ),TogetherData(
                "삽겹살",
                "제품명: 돼지고기 삼겹살\n" +
                        "부위: 삼겹살 (배 부분)\n" +
                        "원산지: 대한민국\n" +
                        "등급: 1등급\n" +
                        "포장 단위: 100g\n" +
                        "유통기한: 제조일로부터 7일\n" +
                        "보관 방법: 냉장 보관 (0~4℃) 또는 냉동 보관 (-18℃ 이하)\n" +
                        "특징:\n" +
                        "신선한 고기\n" +
                        "고소한 맛과 부드러운 식감\n" +
                        "구이, 볶음, 찜 등 다양한 요리에 적합\n" +
                        "안전 및 품질 인증: HACCP 인증, 무항생제 인증\n" +
                        "연락처: 010-9228-4856\n" +
                        "\n" +
                        "기타:\n" +
                        "원재료명: 돼지고기 (삼겹살)\n" +
                        "원산지: 대한민국\n" +
                        "가공 방법:\n" +
                        "도축 후 냉장 보관\n" +
                        "부위별 분리 후 진공 포장\n" +
                        "저온 상태에서 운송\n" +
                        "포장 후 냉장/냉동 보관\n" +
                        "알러지 유발 성분 정보 예시\n" +
                        "알러지 유발 성분:\n" +
                        "이 제품은 돼지고기를 포함하고 있습니다.\n" +
                        "알러지 반응이 있는 소비자는 주의하십시오.\n" +
                        "가공 과정에서 대두, 밀, 우유, 견과류와 같은 알러지 유발 성분과 교차 오염될 수 있습니다.",
                "대구광역시 라임 회장 협회산",
                15,
                1,
                "https://img.khan.co.kr/news/2019/01/10/l_2019011101001196200095012.webp",
                100,
                0
            ),TogetherData(
                "삽겹살",
                "제품명: 돼지고기 삼겹살\n" +
                        "부위: 삼겹살 (배 부분)\n" +
                        "원산지: 대한민국\n" +
                        "등급: 1등급\n" +
                        "포장 단위: 100g\n" +
                        "유통기한: 제조일로부터 7일\n" +
                        "보관 방법: 냉장 보관 (0~4℃) 또는 냉동 보관 (-18℃ 이하)\n" +
                        "특징:\n" +
                        "신선한 고기\n" +
                        "고소한 맛과 부드러운 식감\n" +
                        "구이, 볶음, 찜 등 다양한 요리에 적합\n" +
                        "안전 및 품질 인증: HACCP 인증, 무항생제 인증\n" +
                        "연락처: 010-9228-4856\n" +
                        "\n" +
                        "기타:\n" +
                        "원재료명: 돼지고기 (삼겹살)\n" +
                        "원산지: 대한민국\n" +
                        "가공 방법:\n" +
                        "도축 후 냉장 보관\n" +
                        "부위별 분리 후 진공 포장\n" +
                        "저온 상태에서 운송\n" +
                        "포장 후 냉장/냉동 보관\n" +
                        "알러지 유발 성분 정보 예시\n" +
                        "알러지 유발 성분:\n" +
                        "이 제품은 돼지고기를 포함하고 있습니다.\n" +
                        "알러지 반응이 있는 소비자는 주의하십시오.\n" +
                        "가공 과정에서 대두, 밀, 우유, 견과류와 같은 알러지 유발 성분과 교차 오염될 수 있습니다.",
                "대구광역시 라임 회장 협회산",
                15,
                1,
                "https://img.khan.co.kr/news/2019/01/10/l_2019011101001196200095012.webp",
                100,
                0
            ),TogetherData(
                "삽겹살",
                "제품명: 돼지고기 삼겹살\n" +
                        "부위: 삼겹살 (배 부분)\n" +
                        "원산지: 대한민국\n" +
                        "등급: 1등급\n" +
                        "포장 단위: 100g\n" +
                        "유통기한: 제조일로부터 7일\n" +
                        "보관 방법: 냉장 보관 (0~4℃) 또는 냉동 보관 (-18℃ 이하)\n" +
                        "특징:\n" +
                        "신선한 고기\n" +
                        "고소한 맛과 부드러운 식감\n" +
                        "구이, 볶음, 찜 등 다양한 요리에 적합\n" +
                        "안전 및 품질 인증: HACCP 인증, 무항생제 인증\n" +
                        "연락처: 010-9228-4856\n" +
                        "\n" +
                        "기타:\n" +
                        "원재료명: 돼지고기 (삼겹살)\n" +
                        "원산지: 대한민국\n" +
                        "가공 방법:\n" +
                        "도축 후 냉장 보관\n" +
                        "부위별 분리 후 진공 포장\n" +
                        "저온 상태에서 운송\n" +
                        "포장 후 냉장/냉동 보관\n" +
                        "알러지 유발 성분 정보 예시\n" +
                        "알러지 유발 성분:\n" +
                        "이 제품은 돼지고기를 포함하고 있습니다.\n" +
                        "알러지 반응이 있는 소비자는 주의하십시오.\n" +
                        "가공 과정에서 대두, 밀, 우유, 견과류와 같은 알러지 유발 성분과 교차 오염될 수 있습니다.",
                "대구광역시 라임 회장 협회산",
                15,
                1,
                "https://img.khan.co.kr/news/2019/01/10/l_2019011101001196200095012.webp",
                100,
                0
            ),TogetherData(
                "삽겹살",
                "제품명: 돼지고기 삼겹살\n" +
                        "부위: 삼겹살 (배 부분)\n" +
                        "원산지: 대한민국\n" +
                        "등급: 1등급\n" +
                        "포장 단위: 100g\n" +
                        "유통기한: 제조일로부터 7일\n" +
                        "보관 방법: 냉장 보관 (0~4℃) 또는 냉동 보관 (-18℃ 이하)\n" +
                        "특징:\n" +
                        "신선한 고기\n" +
                        "고소한 맛과 부드러운 식감\n" +
                        "구이, 볶음, 찜 등 다양한 요리에 적합\n" +
                        "안전 및 품질 인증: HACCP 인증, 무항생제 인증\n" +
                        "연락처: 010-9228-4856\n" +
                        "\n" +
                        "기타:\n" +
                        "원재료명: 돼지고기 (삼겹살)\n" +
                        "원산지: 대한민국\n" +
                        "가공 방법:\n" +
                        "도축 후 냉장 보관\n" +
                        "부위별 분리 후 진공 포장\n" +
                        "저온 상태에서 운송\n" +
                        "포장 후 냉장/냉동 보관\n" +
                        "알러지 유발 성분 정보 예시\n" +
                        "알러지 유발 성분:\n" +
                        "이 제품은 돼지고기를 포함하고 있습니다.\n" +
                        "알러지 반응이 있는 소비자는 주의하십시오.\n" +
                        "가공 과정에서 대두, 밀, 우유, 견과류와 같은 알러지 유발 성분과 교차 오염될 수 있습니다.",
                "대구광역시 라임 회장 협회산",
                15,
                1,
                "https://img.khan.co.kr/news/2019/01/10/l_2019011101001196200095012.webp",
                100,
                0
            ),
        )
        return togetherList
    }
}
